#Область ПрограммныйИнтерфейс  
Процедура ОтправкаУведомленийВTelegram() Экспорт   
	
	ТокенБота = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	ИдентификаторГруппы = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	
	Если Не ЗначениеЗаполнено(ТокенБота) Или Не ЗначениеЗаполнено(ИдентификаторГруппы) Тогда
		ВызватьИсключение "Не настроены параметры для Telegram бота!";
	КонецЕсли;
	
	HTTPСоединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL);
	ДанныеДляЗапроса = "bot" + ТокенБота + "/sendMessage";
	
	HTTPЗапрос = Новый HTTPЗапрос(ДанныеДляЗапроса);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
	|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		Сообщение = Новый Структура;
		Сообщение.Вставить("chat_id", ИдентификаторГруппы);
		Сообщение.Вставить("text", Результат.ТекстСообщения); 
		
		СтрокаJson = СтрокаJson(Сообщение);
		
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJson);
		HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		Если HTTPОтвет.КодСостояния = 200 Тогда
			ДокументОбъект = Результат.Ссылка.ПолучитьОбъект();
			ДокументОбъект.Удалить();
		Иначе
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			ЗаписьЖурналаРегистрации("HTTPсервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры
#КонецОбласти	

#Область СлужебныеПроцедурыИФункции
Функция СтрокаJson(ОбъектJson)
	
	ПараметрыЗвписи = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(ПараметрыЗвписи);
	ЗаписатьJSON(Запись, ОбъектJson);
	
	Возврат Запись.Закрыть();
КонецФункции
#КонецОбласти



