#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	
		// регистр ВКМ_ГрафикОтпусков 
	Для Каждого ТекСтрокаОтпускаСотрудников Из ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ГрафикОтпусков.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаОтпускаСотрудников.Сотрудник;
		Движение.ДатаНачала = ТекСтрокаОтпускаСотрудников.ДатаНачала;
		Движение.ДатаОкончания = ТекСтрокаОтпускаСотрудников.ДатаОкончания;
	КонецЦикла;
	Движения.ВКМ_ГрафикОтпусков.Записать(); 
КонецПроцедуры
#КонецОбласти
