#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	РассчитатьНаСервере();
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.Отпуск.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник.КатегорияСотрудника КАК КатегорияСотрудника
	|ИЗ
	|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
	|ГДЕ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Объект.Дата)); 
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Объект.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Объект.Отпуск.Добавить();
			НоваяСтрока.Сотрудник = Выборка.Сотрудник;
			НоваяСтрока.КатегорияСотрудника = Выборка.КатегорияСотрудника;
			НоваяСтрока.ДатаНачала = Выборка.ДатаНачала;
			НоваяСтрока.ДатаОкончания = Выборка.ДатаОкончания;
		КонецЦикла;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("В этом месяце никто не идет в отпуск!");
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура РассчитатьНаСервере()  

	Для Каждого Строка Из Объект.Отпуск Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.ГрафикРаботы КАК ГрафикРаботы,
		|	ВКМ_ОсновныеНачисления.Сумма КАК Сумма,
		|	ВКМ_ОсновныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
		|	ВКМ_ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_ДополнительныеНачисления.Сумма КАК Сумма1,
		|	ВКМ_ДополнительныеНачисления.Сумма + ВКМ_ОсновныеНачисления.Сумма КАК СуммаНачислений
		|ПОМЕСТИТЬ ВТ_Начисления
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|		ПО ВКМ_ДополнительныеНачисления.Сотрудник = ВКМ_ОсновныеНачисления.Сотрудник
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.ПериодРегистрации МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОсновныеНачисления.ГрафикРаботы,
		|	ВКМ_ОсновныеНачисления.Сумма,
		|	ВКМ_ОсновныеНачисления.ПериодРегистрации,
		|	ВКМ_ОсновныеНачисления.ВидРасчета,
		|	ВКМ_ОсновныеНачисления.Сотрудник,
		|	ВКМ_ДополнительныеНачисления.Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Начисления.ГрафикРаботы КАК ГрафикРаботы,
		|	ВТ_Начисления.ПериодРегистрации КАК ПериодРегистрации,
		|	ВТ_Начисления.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ГрафикиРаботы.РабочихДней) КАК РабочихДней,
		|	&ДнейОтпуска КАК ДнейОтпуска,
		|	ЕСТЬNULL(ВТ_Начисления.СуммаНачислений, 0) КАК СуммаВсехНачислений
		|ИЗ
		|	РегистрСведений.ВКМ_ГрафикиРаботы КАК ВКМ_ГрафикиРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Начисления КАК ВТ_Начисления
		|		ПО (ВТ_Начисления.ГрафикРаботы = ВКМ_ГрафикиРаботы.ГрафикРаботы)
		|ГДЕ
		|	ВКМ_ГрафикиРаботы.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВТ_Начисления.Сотрудник = &Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Начисления.ГрафикРаботы,
		|	ВТ_Начисления.ПериодРегистрации,
		|	ВТ_Начисления.Сотрудник,
		|	ЕСТЬNULL(ВТ_Начисления.СуммаНачислений, 0)";
		
		КоличествоМесяцев = 12;
		КонецПериода = Строка.ДатаОкончания - (60 * 60 * 24);
		НачалоПериода = ДобавитьМесяц(Строка.ДатаНачала, - КоличествоМесяцев);
		ДнейОтпуска = (НачалоДня(Строка.ДатаОкончания) - НачалоДня(Строка.ДатаНачала)) / (60 * 60 * 24);
		
		Запрос.УстановитьПараметр("Сотрудник", Строка.Сотрудник);
		Запрос.УстановитьПараметр("ДнейОтпуска", ДнейОтпуска);
		Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
		Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
		
		//@skip-check query-in-loop
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			//Если Выборка.РабочихДней <> 0 Тогда
				Строка.Сумма = Выборка.СуммаВсехНачислений / Выборка.РабочихДней * ДнейОтпуска;
			//Иначе
			//	Строка.Сумма = 0;
			//КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры


#КонецОбласти