#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьНаСервере()
	Объект.Начисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_Сотрудники.КатегорияСотрудника КАК КатегорияСотрудника,
		|	ВКМ_Сотрудники.Наименование КАК Наименование,
		|	ВКМ_Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВКМ_Сотрудники КАК ВКМ_Сотрудники";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Начисления.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Ссылка;
		НоваяСтрока.КатегорияСотрудника = Выборка.КатегорияСотрудника;
		НоваяСтрока.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад;
		НоваяСтрока.ДатаНачала = НачалоМесяца(Объект.Дата);
		НоваяСтрока.ДатаОкончания = КонецМесяца(Объект.Дата);
		НоваяСтрока.ГрафикРаботы = Справочники.ВКМ_ГрафикиРаботы.Пятидневка;
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти
