#Область ПрограммныйИнтерфейс
Процедура ЗаполнитьДокументы(Параметры, АдресРезультата) Экспорт 
	
	Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   ДоговорыКонтрагентов.Ссылка,
    |   ДоговорыКонтрагентов.Наименование,
    |   ДоговорыКонтрагентов.Организация,
    |   ДоговорыКонтрагентов.Владелец
    |ИЗ
    |   Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
    |ГДЕ
    |   НЕ ДоговорыКонтрагентов.ПометкаУдаления
    |   И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
    |   И ДоговорыКонтрагентов.ВКМ_ДатаНачалаАбонентскогоОбслуживания <= &ДатаНачала";
    
    Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);  
    Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Параметры.Период));
    
    ТаблицаДоговоров = Запрос.Выполнить().Выгрузить();
	
	МассивДоговоров = Новый Массив;
    Для Каждого СтрокаДоговора Из ТаблицаДоговоров Цикл
        МассивДоговоров.Добавить(СтрокаДоговора.Наименование);
    КонецЦикла;
    
    ЗапросРеализаций = Новый Запрос;
    ЗапросРеализаций.Текст = 
    "ВЫБРАТЬ
    |   РеализацияТоваровУслуг.Договор.Наименование КАК НаименованиеДоговора
    |ИЗ
    |   Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
    |ГДЕ
    |   РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
    |   И РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
    |   И РеализацияТоваровУслуг.Договор.Наименование В (&МассивДоговоров)
    |   И НЕ РеализацияТоваровУслуг.ПометкаУдаления
    |СГРУППИРОВАТЬ ПО
    |   РеализацияТоваровУслуг.Договор.Наименование";
    
    ЗапросРеализаций.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
    ЗапросРеализаций.УстановитьПараметр("ДатаНачала", НачалоМесяца(Параметры.Период));
    ЗапросРеализаций.УстановитьПараметр("ДатаОкончания", КонецМесяца(Параметры.Период));
    ЗапросРеализаций.УстановитьПараметр("МассивДоговоров", МассивДоговоров);
    
    ДоговорыСРеализациями = Новый Соответствие;
    ТаблицаРеализаций = ЗапросРеализаций.Выполнить().Выгрузить();
    Для Каждого СтрокаРеализации Из ТаблицаРеализаций Цикл
        ДоговорыСРеализациями[СтрокаРеализации.НаименованиеДоговора] = Истина;
    КонецЦикла;
    
    Для Каждого СтрокаДоговора Из ТаблицаДоговоров Цикл
        Если ДоговорыСРеализациями.Получить(СтрокаДоговора.Наименование) = Неопределено Тогда
            ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
            ДокументОбъект.Дата = КонецМесяца(Параметры.Период);
            ДокументОбъект.Организация = СтрокаДоговора.Организация;
            ДокументОбъект.Контрагент = СтрокаДоговора.Владелец;
            ДокументОбъект.Договор = СтрокаДоговора.Ссылка;
            ДокументОбъект.Основание = СтрокаДоговора.Ссылка;
            ДокументОбъект.Комментарий = "Создан обработкой ""Массовое создание документов""";
            ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
            ДокументОбъект.ВыполнитьАвтозаполнение();
            ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
        КонецЕсли;
    КонецЦикла;	
КонецПроцедуры
#КонецОбласти