#Область ОбработчикиСобытийФормы 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПровекаКоличестваДнейОтпуска(); 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПровекаКоличестваДнейОтпуска(); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОткрытьАнализГрафика(Команда)
	
	СтрутураПараметров = Новый Структура;
	СтрутураПараметров.Вставить("Адрес",ПоместитьВоВременноеХранилищеНаСервере()); 
		
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", СтрутураПараметров, ЭтаФорма); 
	
КонецПроцедуры     
#КонецОбласти



#Область СлужебныеПроцедурыИФункции


&НаСервере
Функция ПоместитьВоВременноеХранилищеНаСервере()  
	
	Структура = Новый Структура();
	Структура.Вставить("ОтпускаСотрудников", Объект.ОтпускаСотрудников);
	      
    Адрес = ПоместитьВоВременноеХранилище(Структура, ЭтаФорма.УникальныйИдентификатор); 
	
    Возврат Адрес;
	
КонецФункции 


&НаСервере
Процедура ПровекаКоличестваДнейОтпуска()
	
	Для каждого Строка Из Объект.ОтпускаСотрудников Цикл
		
		Строка.Более28Дней = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания,
		|	РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала, ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ) КАК КоличествоДнейОтпуска
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник = &Сотрудник";
		
		Запрос.УстановитьПараметр("Сотрудник", Строка.Сотрудник);
				
		//@skip-check query-in-loop
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		ОбщееКоличествоДней = 0;
		Пока Выборка.Следующий() Цикл
			ОбщееКоличествоДней = ОбщееКоличествоДней + Выборка.КоличествоДнейОтпуска;
		КонецЦикла;
		
		Если ОбщееКоличествоДней > 28 Тогда
			Строка.Более28Дней = Истина;  
			
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти


