#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//РаасчитатьОтпускные();
	СформироватьДвиженияПоОтпуску(); 
	СформироватьДвиженияПоВзаиморасчетам();
	СформироватьДвиженияПоОтпускамСотрудников();
	
	Движения.ВКМ_Удержания.Записать();
    
	
	
КонецПроцедуры
#КонецОбласти    

#Область СлужебныеПроцедурыИФункции
Процедура СформироватьДвиженияПоОтпуску()
	
	// регистр ВКМ_ОсновныеНачисления
		Для Каждого ТекСтрокаОтпуск Из Отпуск Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск;
		Движение.ПериодДействияНачало = ТекСтрокаОтпуск.ДатаНачала;
		Движение.ПериодДействияКонец = ТекСтрокаОтпуск.ДатаОкончания;
		Движение.ПериодРегистрации = Дата;
		Движение.БазовыйПериодНачало = ТекСтрокаОтпуск.ДатаНачала;
		Движение.БазовыйПериодКонец = ТекСтрокаОтпуск.ДатаОкончания;
		Движение.Сотрудник = ТекСтрокаОтпуск.Сотрудник;  
		Движение.КатегорияСотрудника = ТекСтрокаОтпуск.КатегорияСотрудника;
		Движение.Сумма = ТекСтрокаОтпуск.Сумма; 
		Движение.Регистратор = ЭтотОбъект;
		
		
		НДФЛ = Окр(Движение.Сумма * 0.13, 2);
        
        Движение = Движения.ВКМ_Удержания.Добавить();
        Движение.Сотрудник = ТекСтрокаОтпуск.Сотрудник; 
		Движение.КатегорияСотрудника = ТекСтрокаОтпуск.КатегорияСотрудника;
        Движение.ПериодРегистрации = Дата;
        Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
        Движение.СуммаНДФЛ = НДФЛ;
        Движение.Регистратор = ЭтотОбъект; // Ссылка на текущий документ  
		Движение.Показатель = ТекСтрокаОтпуск.Сумма;
		Движение.БазовыйПериодНачало = ТекСтрокаОтпуск.ДатаНачала;
		Движение.БазовыйПериодКонец = ТекСтрокаОтпуск.ДатаОкончания;

	КонецЦикла;
	
	    Движения.ВКМ_ОсновныеНачисления.Записать();
КонецПроцедуры   

Процедура СформироватьДвиженияПоВзаиморасчетам() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_ОсновныеНачисления.Сумма КАК Сумма,
		|	ВКМ_ОсновныеНачисления.ВидРасчета КАК ВидРасчета
		|ПОМЕСТИТЬ ВТ_ОснНач
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_Удержания.Сотрудник КАК Сотрудник,
		|	ВКМ_Удержания.СуммаНДФЛ КАК СуммаНДФЛ
		|ПОМЕСТИТЬ ВТ_Удержания
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|ГДЕ
		|	ВКМ_Удержания.Регистратор = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОснНач.Сотрудник КАК Сотрудник,
		|	ВТ_ОснНач.Сумма - ВТ_Удержания.СуммаНДФЛ КАК ИтоговаяСумма,
		|	ВТ_ОснНач.ВидРасчета КАК ВидРасчета
		|ИЗ
		|	ВТ_ОснНач КАК ВТ_ОснНач
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Удержания КАК ВТ_Удержания
		|		ПО ВТ_ОснНач.Сотрудник = ВТ_Удержания.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();  
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход; 
		Движение.ВидРасчета = Выборка.ВидРасчета;
		Движение.Сотрудник = Выборка.Сотрудник;    
		Движение.Сумма = Выборка.ИтоговаяСумма;
		Движение.Период = Дата;   
		//Движение.Регистратор = ЭтотОбъект;
	КонецЦикла;  
	
	 Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	

КонецПроцедуры	 

Процедура СформироватьДвиженияПоОтпускамСотрудников() 
	
	Для Каждого ТекСтрокаОтпуск Из Отпуск Цикл
		Движение = Движения.ВКМ_ОтпускаСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаОтпуск.Сотрудник;
		Движение.ДатаНачала = ТекСтрокаОтпуск.ДатаНачала;
		Движение.ДатаОкончания = ТекСтрокаОтпуск.ДатаОкончания;
		Движение.КоличествоДней = (НачалоДня(ТекСтрокаОтпуск.ДатаОкончания) - НачалоДня(ТекСтрокаОтпуск.ДатаНачала)) / (60 * 60 * 24);
	КонецЦикла;
     Движения.ВКМ_ОтпускаСотрудников.Записать();

 КонецПроцедуры
 #КонецОбласти