#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
  		
	СформироватьДвиженияПоПремии(); 
	СформироватьДвиженияПоВзаиморасчетам();
								
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции    
Процедура СформироватьДвиженияПоПремии()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Ссылка КАК Ссылка,
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.НомерСтроки КАК НомерСтроки,
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Сотрудник КАК Сотрудник,
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.СуммаПремии КАК СуммаПремии,
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Сотрудник.КатегорияСотрудника КАК КатегорияСотрудника
		|ИЗ
		|	Документ.ВКМ_НачислениеФиксированнойПремии.СписокСотрудников КАК ВКМ_НачислениеФиксированнойПремииСписокСотрудников
		|ГДЕ
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Дата));    
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Дата));
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.КатегорияСотрудника = Выборка.КатегорияСотрудника;
		Движение.Сумма = Выборка.СуммаПремии;
		Движение.Показатель = Выборка.СуммаПремии;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		Движение.Регистратор = ЭтотОбъект;
				
	    НДФЛ = Окр(Выборка.СуммаПремии * 0.13, 2);
        
        Движение = Движения.ВКМ_Удержания.Добавить();
        Движение.Сотрудник = Выборка.Сотрудник; 
		Движение.КатегорияСотрудника = Выборка.КатегорияСотрудника;
        Движение.ПериодРегистрации = Дата;
        Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
        Движение.СуммаНДФЛ = НДФЛ;
        Движение.Регистратор = ЭтотОбъект; // Ссылка на текущий документ  
		Движение.Показатель = Выборка.СуммаПремии;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
        
	КонецЦикла;
	Движения.ВКМ_ДополнительныеНачисления.Записать();   
	Движения.ВКМ_Удержания.Записать();

КонецПроцедуры 

Процедура СформироватьДвиженияПоВзаиморасчетам() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_ДополнительныеНачисления.Сумма КАК Сумма,
		|	ВКМ_ДополнительныеНачисления.ВидРасчета КАК ВидРасчета
		|ПОМЕСТИТЬ ВТ_ДопНач
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
		|	И ВКМ_ДополнительныеНачисления.ПериодРегистрации МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_Удержания.Сотрудник КАК Сотрудник,
		|	ВКМ_Удержания.СуммаНДФЛ КАК СуммаНДФЛ
		|ПОМЕСТИТЬ ВТ_Удержания
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|ГДЕ
		|	ВКМ_Удержания.Регистратор = &Ссылка
		|	И ВКМ_Удержания.ПериодРегистрации МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДопНач.Сотрудник КАК Сотрудник,
		|	ВТ_ДопНач.Сумма - ВТ_Удержания.СуммаНДФЛ КАК ИтоговаяСумма,
		|	ВТ_ДопНач.ВидРасчета КАК ВидРасчета
		|ИЗ
		|	ВТ_ДопНач КАК ВТ_ДопНач
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Удержания КАК ВТ_Удержания
		|		ПО ВТ_ДопНач.Сотрудник = ВТ_Удержания.Сотрудник";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Дата));    
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход; 
		Движение.ВидРасчета = Выборка.ВидРасчета;
		Движение.Сотрудник = Выборка.Сотрудник;    
		Движение.Сумма = Выборка.ИтоговаяСумма;
		Движение.Период = Дата;
	КонецЦикла;                      
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();

КонецПроцедуры	
#КонецОбласти
