#Область ОбработчикиСобытийФормы

 &НаСервере
 Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	 
	ДанныеДляДиаграммы = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	
	Диаграмма.Очистить();
	
	Для каждого Строка Из ДанныеДляДиаграммы.ОтпускаСотрудников Цикл
		
		Точка = Диаграмма.УстановитьТочку(Строка.Сотрудник);
		Серия = Диаграмма.УстановитьСерию(ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
		Серия.Текст = "Отпуск";
		Значение = Диаграмма.ПолучитьЗначение(Точка,Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
		
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
