//Процедура ЗаполнитьДокументы(Параметры, АдресРезультата) Экспорт  
//	
//	//Получаем список абонентских договоров
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
//	|	ДоговорыКонтрагентов.ВерсияДанных КАК ВерсияДанных,
//	|	ДоговорыКонтрагентов.ПометкаУдаления КАК ПометкаУдаления,
//	|	ДоговорыКонтрагентов.Владелец КАК Владелец,
//	|	ДоговорыКонтрагентов.Код КАК Код,
//	|	ДоговорыКонтрагентов.Наименование КАК Наименование,
//	|	ДоговорыКонтрагентов.Организация КАК Организация,
//	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
//	|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаАбонентскогоОбслуживания КАК ВКМ_ДатаНачалаАбонентскогоОбслуживания,
//	|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияАбонентскогоОбслуживания КАК ВКМ_ДатаОкончанияАбонентскогоОбслуживания,
//	|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК ВКМ_СуммаАбонентскойПлаты,
//	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК ВКМ_СтоимостьЧасаРаботы,
//	|	ДоговорыКонтрагентов.Предопределенный КАК Предопределенный,
//	|	ДоговорыКонтрагентов.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
//	|	ДоговорыКонтрагентов.Представление КАК Представление
//	|ИЗ
//	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
//	|ГДЕ
//	|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
//	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";
//	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//		
//		ЗапросРеализации = Новый Запрос;
//		ЗапросРеализации.Текст = 
//		"ВЫБРАТЬ ПЕРВЫЕ 1
//		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
//		|ИЗ
//		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
//		|ГДЕ
//		|	РеализацияТоваровУслуг.Договор = &Договор
//		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
//		
//		ЗапросРеализации.УстановитьПараметр("Договор", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
//		ЗапросРеализации.УстановитьПараметр("НачалоПериода", НачалоМесяца(Параметры.Период));
//		ЗапросРеализации.УстановитьПараметр("КонецПериода", КонецМесяца(Параметры.Период));
//		
//		РезультатЗапроса = ЗапросРеализации.Выполнить();
//		Если РезультатЗапроса.Пустой() Тогда  
//			ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент(); 
//			ДокументОбъект.Дата = КонецМесяца(Параметры.Период);
//			ДокументОбъект.Организация = Выборка.Организация;
//			ДокументОбъект.Контрагент = Выборка.Владелец;
//			ДокументОбъект.Договор = Выборка.Ссылка;
//			
//			ДокументОбъект.Основание = Выборка.Ссылка;
//			ДокументОбъект.Комментарий = "Создан обработкой ""Массовое создание документов""";
//			ДокументОбъект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
//			ДокументОбъект.ВыполнитьАвтозаполнение(); 
//			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
//			НоваяСтрока = Объект.Договоры.Добавить();
//			НоваяСтрока.Договор = Выборка.Ссылка;
//			НоваяСтрока.Реализация = ДокументОбъект.Ссылка; 
//		Иначе
//			Продолжить
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//КонецПРоцедуры
